# IsValidIndex Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetProperties..::..IsValidIndex Method
AssetProperties Class See Also
---
Returns true if the provided index is valid.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool IsValidIndex(
	int index
)
```

Visual Basic
---
```text
Public Function IsValidIndex ( _
	index As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidIndex(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 Index to be validated.
# ### Return Value
True if index is valid, false otherwise.
# See Also
AssetProperties Class
Autodesk.Revit.DB.Visual Namespace